Repository: enterstudio/moose-website
Catalog: lib/Moose/Website/I18N/po/*.po
Languages: de, es

source: header moose
de: Moose
es: Moose

source: header moose subtitle
de: Ein postmodernes Objektsystem für Perl
es: Un Sistema de Objetos Postmoderno para Perl

source: moose page title
de: Moose - Ein postmodernes Objektsystem für Perl
es: Moose - Un Sistema de Objetos Postmoderno para Perl

source: nav home
de: Hauptseite
es: Inicio

source: nav blog
de: Blog
es: Blog

source: nav about
de: Über
es: Acerca de

source: nav articles
de: Artikel
es: Artículos

source: nav download
de: Download
es: Descargas

source: nav support
de: Hilfe
es: Soporte

source: nav presentations
de: Vorträge
es: Presentaciones

source: home body
de: <p>Moose ist ein <a href='http://www.perl.com/pub/a/1999/03/pm.html'>postmodernes Objektsystem</a> für Perl 5, das keine Langeweile beim Programmieren von objektorientiertem Perl aufkommen lässt. Es beinhaltet die besten Merkmale von Perl 6, <acronym title='Common Lisp Object System'>CLOS</acronym> (Lisp), Smalltalk, Java, BETA, OCaml, Ruby und weiteren, bleibt aber seinen Wurzeln in Perl 5 treu.</p><p>Moose ist 100%ig für den Produktionseinsatz bereit und wird in einer Vielzahl von Systemen verwendet und täglich werden es mehr. <a href='http://search.cpan.org/dist/Moose'>Probiere es jetzt aus!</a></p>
es: <p>Moose es un <a href='http://www.perl.com/pub/a/1999/03/pm.html'>sistema de objetos postmoderno</a> para Perl que le quita lo tedioso a escribir Perl orientado a objetos. Toma las mejores funciones de Perl 6, <acronym title='Common Lisp Object System'>CLOS</acronym> (Lisp), Smalltalk, Java, BETA, OCaml, Ruby y más, pero mantiene firmes sus raíces de Perl 5.</p><p>Moose está 100% listo para producción, y se usa actualmente en un gran número de sistemas que crece a diario. <a href='https://metacpan.org/release/Moose'>¡Pruébalo hoy!</a></p>

source: about body
de: <p>Moose ist eine Erweiterung des Objektsystems von Perl 5. Das Hauptanliegen von Moose ist es, objektorientierte Programmierung in Perl 5 einfacher, konsistenter und kurzweiliger zu machen. Mit Moose kann man mehr darüber nachdenken, was man erreichen will und weniger über die Eigenheiten der <acronym title='objektorientierten Programmierung'>OOP</acronym>.</p> <p><a href='#code_sample' rel='facebox'>Moose-Beispielcode</a></p>
es: <p>Moose es una extensión del sistema de objetos de Perl 5. Su objetivo principal es hacer más fácil la programación orientada a objetos en Perl 5, así como más consistente y menos tediosa. Con Moose, puedes pensar más acerca de lo que quieres hacer, y menos acerca del mecanismo de la <acronym title='object-oriented programming (programación orientada a objetos)'>OOP</acronym>.</p><p><a href='#code_sample' rel='facebox'>Ejemplo de código de Moose</a></p>

source: about new to moose header
de: Einführung in Moose
es: ¿Eres nuevo?

source: about new to moose body
de: <p>Wenn du Moose noch nicht kennst, fange am besten mit der Dokumentation in <a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual.pod'><code> Moose::Manual</code></a> an, gefolgt von <a href='http://search.cpan.org/dist/Moose/lib/Moose/Cookbook.pod'><code>Moose::Cookbook</code></a>. Die Einführung demonstriert, was Moose ist und wie es die <acronym title='Objektorientierung'>OO</acronym> von Perl 5 verbessert.</p> <p>Die Rezepte im Kochbuch über die Grundlagen von Moose machen dich schnell mit vielen Merkmalen von Moose vertraut. Wenn du eine Vorstellung davon bekommen hast, was man mit Moose machen kann, kannst du die <acronym title='application programming interface'>API</acronym>-Dokumentation benutzen, um die Details von interessanten Merkmalen nachzuschlagen.</p>
es: <p>Si nunca has usado Moose, el mejor lugar para empezar son los documentos del <a href='https://metacpan.org/pod/Moose::Manual'><code>Moose::Manual</code></a>, seguido por el <a href='https://metacpan.org/pod/Moose::Cookbook'><code>Moose::Cookbook (recetario)</code></a>. La introducción te mostrará qué es Moose, y cómo hace la <acronym title='orientación a objetos'>OO</acronym> de Perl 5 más fácil.</p><p>Las recetas del recetario de Moose básico te enseñará rápidamente muchas funciones de Moose. Una vez que tengas una idea de qué puede hacer Moose, puedes usar la documentación del <acronym title='application programming interface (interfaz de programación de aplicaciones)'>API</acronym> para conocer más a detalle las funciones que te interesen.</p><p>Moose también aparece en varios libros:</p><ul><li><a href='http://www.onyxneon.com/books/modern_perl/index.html'>Modern Perl (Perl Moderno)</a></li><li><a href='http://apress.com/book/view/1430223650'>The Definitive Guide to Catalyst (La gúia definitiva a Catalyst)</a></li><li><a href='http://perlmoderne.fr/'>Perl Moderne (Perl Moderno)</a></ul>

source: about organization list header
de: Organisationen, die Moose benutzen
es: Organizaciones que usan Moose

source: about organization list body
de: <p>Moose wird von einer großen Anzahl von Organisation auf der ganzen Welt verwendet, einige von ihnen sind:</p>
es: <p>Moose es usado por un gran número de organizaciones alrededor del mundo, algunas de las cuales son:</p>

source: download body
de: <p>Moose und verwandte Module sind über <acronym title='Comprehensive Perl Archive Network'>CPAN</acronym>, der weltweiten gespiegelten Plattform für Perl zur Verteilung von Modulen, verfügbar. Moose wird auch <a href='http://cpants.perl.org/dist/used_by/Moose'>von anderen <acronym title='Comprehensive Perl Archive Network'>CPAN</acronym>-Modulen verwendet</a>.</p>
es: <p>Moose y sus módulos relacionados se pueden descargar del <acronym title='Comprehensive Perl Archive Network'>CPAN</acronym>, la plataforma de distribución mundial de Perl. Moose también es <a href='http://cpants.perl.org/dist/used_by/Moose'>usado por otros módulos de <acronym title='Comprehensive Perl Archive Network'>CPAN</acronym></a>.</p>

source: download info Moose
de: Die Moose-Hauptdistribution
es: La distribución base de Moose

source: download info <code>Class::MOP</code>
de: Das Metaobjektprotokoll, auf welchem Moose aufbaut

source: download info <code>Task::Moose</code>
de: Eine Sammlung hervorragender Erweiterungen für Moose
es: Una colección de extensiones de Moose excelentes

source: download info <code>Task::Kensho</code>
de: Eine Sammlung hervorragender moderner Perl-Module
es: Una colección de módulos de Perl excelentes

source: download info <code>MooseX::*</code>
de: Die Moose-Erweiterungen
es: Extensiones de Moose

source: download git header
de: Git
es: Git

source: download git body
de: <p>Moose wird mit Hilfe der <a href='http://git-scm.com/'>Git-Versionsverwaltung</a> entwickelt. Moose ist ein sehr offenes Projekt und wir sind immer bereit, andere mitwirken zu lassen. <a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual/Contributing.pod'><code>Moose::Manual::Contributing</code></a> stellt unsere speziellen Richtlinien zur Mitwirkung, und wie man mit unserem Arbeitsablauf anfängt, dar.</p><p><a href='http://search.cpan.org/~apocal/'>Apocalypse</a> hat <a href='http://www.youtube.com/watch?v=Gwq10W0RaHQ&amp;hd=1'>die Aktivität im Git-Repository von Moose</a> und <a href='http://www.youtube.com/watch?v=HlJDnvNSfJo&amp;hd=1'><code>Class::MOP</code></a> zur Veröffentlichung ihrer 1.0-Versionen visualisiert. Diese Darstellungen wurden mit <a href='http://code.google.com/p/gource/wiki/Videos'>Gource</a> erzeugt.</p>
es: <p>Moose es desarrollado usando el <a href='http://git-scm.com/'>sistema de control de versiones Git</a>. Moose es un proyecto muy abierto, y siempre estamos dispuestos a recibir contribuciones de los demás. <a href='https://metacpan.org/pod/Moose::Manual::Contributing'><code>Moose::Manual::Contributing</code></a> describe nuestras políticas de contribución y te explica cómo comenzar con nosotros.</p><p><a href='https://metacpan.org/author/APOCAL'>Apocalypse</a> visualizó <a href='http://www.youtube.com/watch?v=Gwq10W0RaHQ&amp;hd=1'>la actividad en los repositorios de Git de Moose</a> y <a href='http://www.youtube.com/watch?v=HlJDnvNSfJo&amp;hd=1'><code>Class::MOP</code></a> cuando lanzaron su versión 1.0. Estas visualizaciones fueron creadas con <a href='http://code.google.com/p/gource/wiki/Videos'>Gource</a>.</p>

source: download git public
de: URL des öffentlichen Git-Repositorys
es: URL del repositorio público de Git

source: download git committer
de: Git-URL für Beitragende
es: URL de Git para committers

source: download git web view
de: Git-Webansicht
es: Git Web View

source: download github mirror
de: Kopie auf GitHub
es: Mirror en GitHub

source: support body
de: <p>Moose ist ein Gemeinschaftsprojekt und du kannst dir Hilfe und Unterstützung von den offiziellen <acronym title='Internet relay chat'>IRC</acronym>-Kanälen und Mailinglisten, aber auch von gemeinschaftlichen Hilfeangeboten wie <a href='http://www.perlmonks.org'>PerlMonks</a> und <a href='http://www.stackoverflow.com'>Stack Overflow</a> holen. Du kannst auch die offizielle Dokumentation in <a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual/Support.pod'><code>Moose::Manual::Support</code></a> für weitere Details heranziehen.</p>
es: <p>Moose es un proyecto comunitario, y puedes conseguir ayuda y soporte en los canales oficiales de <acronym title='Internet relay chat'>IRC</acronym> y listas de correo, así como en sitios de ayuda comunitaria como <a href='http://www.perlmonks.org'>PerlMonks</a> y <a href='http://www.stackoverflow.com'>Stack Overflow</a>. También puedes referirte a la documentación oficial en <a href='https://metacpan.org/pod/Moose::Manual::Support'><code>Moose::Manual::Support</code></a> para más detalles.</p>

source: support irc header
de: <acronym title='Internet relay chat'>IRC</acronym>-Kanäle
es: Canales de <acronym title='Internet relay chat'>IRC</acronym>

source: support irc body
de: <p>Am schnellsten bekommt man Hilfe zu Moose, indem man die Gemeinschaft im <acronym title='Internet relay chat'>IRC</acronym> in Anspruch nimmt.</p>
es: <p>La manera más rápida de conseguir soporte con Moose es involucrarse con la comunidad usando <acronym title='Internet relay chat'>IRC</acronym>.</p>

source: support mailing list header
de: Mailingliste
es: Lista de Correo

source: support mailing list body
de: <p>Die Moose-Mailingliste kann ein hervorragender Ort sein, deine Fragen beantwortet zu bekommen.</p>
es: <p>Las listas de correo de Moose son una manera excelente para que tus preguntas sean contestadas.</p>

source: support misc header
de: Sonstiges
es: Misc.

source: support misc body
de: <p>Vielleicht sind einige andere Dinge nützlich.</p>
es: <p>Tal vez te pueden ser útiles estos enlaces.</p>

source: support moose mailing list
de: Moose-Mailingliste
es: Lista de correo de Moose

source: support moose mailing list archives
de: Archiv der Moose-Mailingliste
es: Archivos de la lista de correo de Moose

source: support textmate bundle
de: TextMate-Bündel für Moose
es: Paquete de Moose y TextMate

source: support quickref card
de: Schnellreferenzkarte für Moose
es: Tarjeta de Referencia Rápida de Moose

source: articles body
de: <p>Viele interessante und nützliche Artikel und Blogeinträge werden über Moose geschrieben. Das <a href='http://ironman.enlightenedperl.org/'>Blog <i xml:lang='en'>Perl Iron Man</i></a> hat ziemlich oft Moose-bezogene Einträge.</p> <p>Wenn du einen Artikel oder Blogeintrag kennst, der eingebunden werden sollte, <a href='support.html'>gib uns über <acronym title='Internet relay chat'>IRC</acronym> oder die Mailingliste Bescheid</a> und wir fügen ihn hier hinzu.</p>
es: <p>Hay muchos artículos útiles y blogs acerca de Moose. El <a href='http://ironman.enlightenedperl.org/'>blog de Perl Iron Man (en inglés)</a> usualmente tiene artículos relacionados con Moose.</p><p>Si conoces algún artículo o blog que crees que deberíamos incluir, <a href='support.html'>háznoslo saber vía <acronym title='Internet relay chat'>IRC</acronym> o la lista de correo</a> y lo agregaremos aquí.</p>

source: presentations body
de: <p>Benutzer von Moose tragen bei Konferenzen und örtlichen Perlmonger-Gruppentreffen vor.</p> <p>Wenn du einen Vortrag kennst, der eingebunden werden sollte, <a href='support.html'>gib uns über <acronym title='Internet relay chat'>IRC</acronym> oder die Mailingliste Bescheid</a> und wir fügen ihn hier hinzu.</p>
es: <p>Los usuarios de Moose hacen presentaciones y conferencias en grupos locales de Perl Mongers.</p><p>Si conoces alguna presentación que crees que deberíamos incluír, <a href='support.html'>háznoslo saber vía <acronym title='Internet relay chat'>IRC</acronym> o la lista de correo</a> y lo agregaremos aquí.</p>

source: presentations video label
de: Video
es: video

source: presentations podcast label
de: Podcast
es: podcast

source: presentations Perl Mongers Groups
de: Perlmonger-Gruppen
es: Grupos de Perl Mongers

source: footer copyright
de: Copyright © <a href='http://www.iinteractive.com'>Infinity Interactive</a>, 2006 – 2010
es: Copyright © <a href='http://www.iinteractive.com'>Infinity Interactive</a>, 2006 – 2010

source: footer terms
de: Diese Programmbibliothek ist Freie Software, du darfst sie unter denselben Bedingungen wie von Perl weiter verteilen und/oder verändern.
es: Esta biblioteca es software libre; puedes redistribuirla y/o modificarla bajo los mismos términos que Perl.
